export const ru = {
  menu: {
    socials: "Социальные сети",
    cv: "Резюме",
    portfolio: "Портфолио",
    skills: "Навыки",
    welcome: "Приветствие",
    language: "ENG",
  },
  socials: {
    telegram: "Телеграм",
    github: "Гитхаб",
    instagram: "Инстаграм",
  },
  about: {
    title: "Приветствие.txt",
    greeting: "Привет!",
    description:
      "Привет! Я Данила, фронтенд-разработчик. Считайте меня рок-звездой кодинга, ястребом, истребляющим баги, и просто крутым разработчиком, который стремится создавать первоклассные решения. Я погрузился в разработку продуктов в различных областях — будь то работа в штате или фриланс для стартапов, у меня есть все необходимые навыки.",
    description2:
      "Я специализируюсь на написании чистого, структурированного кода, который легко читать и поддерживать. Я люблю заниматься разработкой интерфейсов, создавать потрясающие анимации и разрабатывать пользовательские компоненты, от которых пользователи приходят в восторг. Давайте создадим что-то удивительное вместе!",
    questions: "есть вопросы? Мой",
  },
  skills: {
    title: "Навыки.txt",
    heading: "Мои навыки",
    description:
      "Я считаю себя универсалом. Я сталкивался с множеством различных задач и обязанностей и изучил множество различных областей в индустрии дизайна. Однако я не согласен с количественной оценкой навыков в виде чисел; проценты, единицы и т.д. - действительно ли навыки можно измерить? Тем не менее, вот приблизительная оценка некоторых моих навыков в виде прогресс-баров.",
    designTools: "Инструменты дизайна",
    devTools: "Инструменты разработки",
    otherSkills: "Другие навыки",
    tools: {
      figma: "Figma",
      photoshop: "Adobe Photoshop",
      illustrator: "Adobe Illustrator",
      javascript: "JavaScript/TypeScript",
      storybook: "Storybook",
      html: "HTML, CSS, SASS",
      git: "Git",
      react: "React",
      vue: "Vue",
      nuxt: "Nuxt.Js",
      next: "Next.Js",
      gatsby: "Gatsby.Js",
    },
    other: {
      agile: "Методы Agile",
      codeReview: "Код-ревью",
      productDev: "Разработка продуктов",
      seo: "SEO оптимизация",
      projectManagement: "Управление проектами",
      designSystems: "Дизайн-системы",
      userInterviews: "Пользовательские интервью",
      userTesting: "Тестирование пользователей",
      base: "Базовые навыки и прототипирование",
      research: "Исследования",
    },
  },
  clippy: {
    greetings: [
      "Привет! Давай познакомимся поближе.",
      "Гав гав! Or Wuff wuff in English!",
      "псс... Cafebotum - лучшее приложение в мире.",
    ],
  },
  portfolio: {
    title: "Портфолио.txt",
    heading: "Краткое портфолио",
    description:
      "Это сокращенная, невизуальная версия моего портфолио без подробной информации о проектах, над которыми я работал. Если вас интересует более подробная информация о какой-либо из моих работ, пожалуйста, свяжитесь со мной для звонка, и я представлю более подробную информацию.",
    role: "Роль: Front-end разработчик",
    stack: "Стек:",
    background: "Контекст",
    solution: "Решение",
    visitSite: "Посетить сайт",
    projects: {
      meetMarket: {
        title: "Meet Market",
        stack:
          "Vue.Js 2/3, Nuxt.Js 2/3, Vuetify 2, Vuex, TypeScript, Storybook, Pinia",
        background:
          "Meet Market - это интернет-магазин, специализирующийся на фирменной обуви, одежде и аксессуарах, осуществляющий доставку по России и СНГ. Компания занимается логистикой, обработкой документов, конвертацией валют и проверкой подлинности продукции, гарантируя клиентам получение качественных товаров с уверенностью.",
        solution:
          "В своей роли в Meet Market я внедрил адаптивные и кросс-браузерные методы разработки, которые значительно улучшили пользовательский опыт. Это привело к увеличению скорости приложения на 20% и уменьшению размера пакета в 3 раза. Я разработал одностраничное приложение и панель управления, что способствовало попаданию в топ-5 по ключевым поисковым запросам. Кроме того, я создал пользовательскую библиотеку UI и тесно сотрудничал с бэкенд-разработчиками и дизайнерами для обеспечения плавной доставки проекта. Мои обязанности включали ручное тестирование, редизайн интерфейсов и шаблоны электронной почты, что значительно улучшило качество общения с клиентами. Кроме того, мое активное участие в конференциях и способность решать технические проблемы, такие как настройка серверов разработки, демонстрируют мою приверженность непрерывному обучению и профессиональному росту.",
      },
      taxiO2: {
        title: "Taxi O₂",
        stack: "Vue.Js, Bootstrap, Pinia",
        background:
          "Это стартап, ориентированный на приложение для заказа такси, которое позволяет водителям устанавливать свою цену за километр, способствуя конкурентной и гибкой модели ценообразования. Пассажиры могут просматривать профили, рейтинги и цены доступных водителей, позволяя им выбрать предпочтительного водителя для персонализированного и приятного поездки.",
        solution:
          "В своей роли единственного фронтенд-разработчика в стартапе я отвечал за разработку всего фронтенда приложения для заказа такси, сосредоточившись на реализации основной логики, которая позволяла водителям устанавливать свою цену за километр, а пассажирам выбирать предпочтительных водителей. Я тесно сотрудничал с бэкенд-разработчиками для интеграции API, обеспечивая бесшовную коммуникацию между фронтендом и бэкендом. Мы внедрили функции, улучшающие пользовательский опыт, такие как обновления в реальном времени о доступности водителей и отслеживание поездки.",
      },
      cafebotum: {
        title: "Cafebotum",
        stack:
          "React.Js, Gatsby.Js, Next.Js, Typescript, Bootstrap, CSS modules",
        background:
          "Cafebotum - это приложение в Telegram, облачная платформа, предназначенная для цифровизации заведений. Приложение позволяет пользователям создать полностью функциональное веб-приложение всего за 7 минут, включающее онлайн-меню, управление заказами, систему лояльности, онлайн-оплату и варианты доставки.",
        solution:
          "Я отвечал за создание адаптивной, кросс-браузерной и семантической разметки для различных проектов. Я разработал лендинг с использованием Gatsby, обеспечивая оптимальную производительность и пользовательский опыт. Тесно сотрудничая с бэкенд-разработчиком, мы создали потрясающий дизайн и интегрировали функции, которые улучшили общую функциональность приложения. Создал новую функциональность для админ-панели, которая сыграла значительную роль в привлечении новых пользователей на платформу. Также работал над созданием Telegram Mini App, расширяя охват и вовлеченность пользователей на популярных платформах обмена сообщениями. Мои усилия также были направлены на оптимизацию приложения для SEO, что привело к улучшению видимости и трафика на наш сайт. В целом, это небольшой стартап с большими амбициями.",
      },
      iilab: {
        title: "iilab",
        stack: "TypeScript, Vue.Js, Nuxt.Js + SCSS + Pinia + Storybook",
        background:
          "Это продуктовая IT-компания, основанная в мае 2020 года, специализирующаяся на разработке веб-сайтов и мобильных приложений для iOS и Android, а также на оптимизации бизнес-процессов и интеграции IT-решений. Наш основной клиент - RC Group, для которого мы выступаем в качестве технической дирекции и выполняем аутсорсинговые проекты. С момента основания мы выросли с 20 до более чем 150 сотрудников и расширили наш офис до 4000 квадратных метров, предлагая широкий спектр высоконагруженных IT-решений.",
        solution:
          "Я внес значительный вклад в различные проекты, которые повысили эффективность нашей команды и качество продукта. Я разработал UI-библиотеку, которая улучшила согласованность между приложениями, и руководил полным редизайном веб-сайта компании, оптимизируя пользовательский опыт и производительность. Внедрил Nuxt для оптимизации серверного рендеринга и работал как над админ-панелью, так и над клиентской частью платформы маркетплейса, улучшая взаимодействие с пользователем. Кроме того, я проводил технические собеседования для оценки кандидатов, наставлял младших разработчиков и выполнял код-ревью для поддержания высоких стандартов качества кода. Этот опыт укрепил мои навыки разработки и управления проектами, способствуя успеху наших проектов.",
      },
    },
  },
};
